Revit 2027 API
Mesh.Transformed Property
Transforms this mesh and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Mesh this[
	Transform transform
] { get; }
Public ReadOnly Property Transformed (
	transform As Transform
) As Mesh
	Get
public:
property Mesh^ Transformed[Transform^ transform] {
	Mesh^ get (Transform^ transform);
}
member Transformed : Mesh with get
Parameters
transform Transform
The transformation used to transform the profile.
Return Value
Mesh
The transformed mesh.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the handle of the specified transformation is null.
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace